app/controllers/posts_controller.rb

    def index
		if params[:author_id] # This is for route /authors/1/posts.
			@posts = Author.find(params[:author_id]).posts
		else # This is for route /posts.
			@posts = Post.all
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"